Tekla Open API Reference for Tekla Structures 2025
Events.DrawingUpdated Event
 The DrawingUpdated event is raised when the drawing has been inserted, deleted or modified, and the database is committed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingUpdatedDelegate DrawingUpdated
Public Event DrawingUpdated As Events.DrawingUpdatedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingUpdatedDelegate
Implements
IEvents.DrawingUpdated
See Also
Reference
Events Class
Tekla.Structures.Drawing Namespace